tap "homebrew/bundle"

brew "mas"

cask "1password-cli"
cask "arc"
cask "appcleaner"
cask "audio-hijack"
cask "beekeeper-studio"
cask "blackhole-2ch"
cask "cursor"
cask "dash"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "kubecontext"
cask "lens"
cask "loopback"
cask "obsidian"
cask "ollama"
cask "opal-composer"
cask "orbstack"
cask "podman-desktop"
cask "rapidapi"
cask "raycast"
cask "slack"
cask "sublime-text"

mas "Contact Organizer", id: 922498351
mas "DaisyDisk", id: 411643860
mas "Fantastical - Calendar", id: 975937182
mas "Folder Tidy", id: 486626129
mas "Hidden Bar", id: 1452453066
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Word", id: 462054704
mas "Pixelmator Pro", id: 1289583905
mas "Soulver 3", id: 1508732804
mas "Stay", id: 435410196
mas "Transmit", id: 1436522307
