tap "homebrew/bundle"
tap "romkatv/powerlevel10k"

brew "aicommits"
brew "awscli"
brew "chezmoi"
brew "cmake"
brew "ctop"
brew "direnv"
brew "duti"
brew "expect"
brew "goenv"
brew "jq"
brew "k9s"
brew "krew"
brew "nodenv"
brew "pam-reattach"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "terraform"
brew "tmux"
brew "tree"
